<template>
    <div class="notice">
      <div class="notice-title">
  <svg style="vertical-align: middle" t="1624784557742" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10590" width="26" height="26"><path d="M448.646465 1024s-2.585859-196.525253-18.10101-374.949495c-31.030303-7.757576-64.646465-23.272727-116.363637-62.060606l-20.686869-15.515152C169.373737 486.141414 120.242424 367.191919 120.242424 261.171717c0-25.858586 2.585859-51.717172 10.343435-72.40404C148.686869 118.949495 195.232323 72.40404 246.949495 69.818182c54.30303-2.585859 131.878788 33.616162 201.69697 227.555555 15.515152 38.787879 23.272727 90.505051 33.616161 142.222223C531.393939 250.828283 596.040404 67.232323 699.474747 15.515152c41.373737-20.686869 87.919192-20.686869 131.878788 5.171717 43.959596 23.272727 67.232323 64.646465 69.818182 111.191919v10.343434c0 160.323232-217.212121 380.121212-268.929293 418.909091-49.131313 36.20202-82.747475 59.474747-113.777778 72.404041 0 5.171717-2.585859 10.343434-2.585858 18.10101 0 0-2.585859 20.686869-5.171717 20.686868 12.929293 160.323232 15.515152 349.090909 15.515151 349.090909l-77.575757 2.585859z" fill="#FDDFDF" p-id="10591"></path></svg>
     <span style="margin-left:5px">公告</span>
      </div>
      <div class="notice-content">
          <span> 欢迎来到这里</span>
      </div>
      
    </div>
</template>
<style>
.notice{
     background: rgb(245,245,245);
    box-shadow:7px 7px 5px 3px #999; 
    font-family: STZhongsong,YouYuan;
    line-height: 2;
    width: 90%;
    height: auto;
    margin: 0 auto;
    margin-top: 50px;
    border-radius: 25px;
    display: flex;
    flex-direction: column;
}
.notice-title{
    font-size: 1.2rem;
    display: inline;
    width: 100%;
 margin: 5px 30px;
}
.notice-content{
    margin: 5px 30px;
}

</style>